import { TReviewItemProps } from "@/types/reviews";

export const REVIEWS: TReviewItemProps[] = [
    {
        date: "23.12.2024",
        rating: 4.7,
        subtitle:
            "Все прошло отлично! Я сразу получила кешбэк после того как продацев подтвердил мои действия.",
        title: "Анна",
        productName: "Зарядка для iphone 20W type-c быстрое устройство",
    },
    {
        date: "23.12.2024",
        rating: 4.7,
        subtitle:
            "Все прошло отлично! Я сразу получила кешбэк после того как продацев подтвердил мои действия.",
        title: "Анна",
        productName: "Зарядка для iphone 20W type-c быстрое устройство",
    },
    {
        date: "23.12.2024",
        rating: 4.7,
        subtitle:
            "Все прошло отлично! Я сразу получила кешбэк после того как продацев подтвердил мои действия.",
        title: "Анна",
        productName: "Зарядка для iphone 20W type-c быстрое устройство",
    },
    {
        date: "23.12.2024",
        rating: 4.7,
        subtitle:
            "Все прошло отлично! Я сразу получила кешбэк после того как продацев подтвердил мои действия.",
        title: "Анна",
        productName: "Зарядка для iphone 20W type-c быстрое устройство",
    },
];
