import { TProductItemProps } from '@/types'

export const isAuth = true
export const salesmanProducts: TProductItemProps[] = [
	{
		id: 1,
		previewImage: '/images/stub/product-stub.png',
		images: [
			'/images/stub/product-stub.png',
			'/images/stub/product-stub-2.png',
			'/images/stub/product-stub-3.png',
			'/images/stub/product-stub-4.png',
		],
		isFavorite: true,
		name: 'Зарядка для iphone 20W type-c быстрое устройство',
		price: {
			price: (500 * 1) / (1 + 2),
			discount: 20,
		},
		quantities: 221,
		tooltip: 'Подсказка',
		productDescription:
			'Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ',
		salesmanId: 1 + 1,
	},
	{
		id: 2,
		previewImage: '/images/stub/product-stub.png',
		images: [
			'/images/stub/product-stub.png',
			'/images/stub/product-stub-2.png',
			'/images/stub/product-stub-3.png',
			'/images/stub/product-stub-4.png',
		],
		isFavorite: true,
		name: 'Зарядка для iphone 20W type-c быстрое устройство',
		price: {
			price: (500 * 2) / (2 + 2),
			discount: 20,
		},
		quantities: 221,
		tooltip: 'Подсказка',
		productDescription:
			'Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ',
		salesmanId: 2 + 1,
	},
	{
		id: 3,
		previewImage: '/images/stub/product-stub.png',
		images: [
			'/images/stub/product-stub.png',
			'/images/stub/product-stub-2.png',
			'/images/stub/product-stub-3.png',
			'/images/stub/product-stub-4.png',
		],
		isFavorite: true,
		name: 'Зарядка для iphone 20W type-c быстрое устройство',
		price: {
			price: (500 * 3) / (3 + 2),
			discount: 20,
		},
		quantities: 221,
		tooltip: 'Подсказка',
		productDescription:
			'Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ',
		salesmanId: 3 + 1,
	},
]
export const favoriteProducts: TProductItemProps[] = [
	{
		id: 1,
		previewImage: '/images/stub/product-stub.png',
		images: [
			'/images/stub/product-stub.png',
			'/images/stub/product-stub-2.png',
			'/images/stub/product-stub-3.png',
			'/images/stub/product-stub-4.png',
		],
		isFavorite: true,
		name: 'Зарядка для iphone 20W type-c быстрое устройство',
		price: {
			price: (500 * 1) / (1 + 2),
			discount: 20,
		},
		quantities: 221,
		tooltip: 'Подсказка',
		productDescription:
			'Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ',
		salesmanId: 1 + 1,
	},
	{
		id: 2,
		previewImage: '/images/stub/product-stub.png',
		images: [
			'/images/stub/product-stub.png',
			'/images/stub/product-stub-2.png',
			'/images/stub/product-stub-3.png',
			'/images/stub/product-stub-4.png',
		],
		isFavorite: true,
		name: 'Зарядка для iphone 20W type-c быстрое устройство',
		price: {
			price: (500 * 2) / (2 + 2),
			discount: 20,
		},
		quantities: 221,
		tooltip: 'Подсказка',
		productDescription:
			'Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ',
		salesmanId: 2 + 1,
	},
	{
		id: 3,
		previewImage: '/images/stub/product-stub.png',
		images: [
			'/images/stub/product-stub.png',
			'/images/stub/product-stub-2.png',
			'/images/stub/product-stub-3.png',
			'/images/stub/product-stub-4.png',
		],
		isFavorite: true,
		name: 'Зарядка для iphone 20W type-c быстрое устройство',
		price: {
			price: (500 * 3) / (3 + 2),
			discount: 20,
		},
		quantities: 221,
		tooltip: 'Подсказка',
		productDescription:
			'Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ',
		salesmanId: 3 + 1,
	},
]
