import { TProductItemProps } from "@/types";

export const PRODUCTS: TProductItemProps[] = [
    {
        id: 1,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 1) / (1 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 1 + 1,
    },
    {
        id: 2,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 2) / (2 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 2 + 1,
    },
    {
        id: 3,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 3) / (3 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 3 + 1,
    },
    {
        id: 4,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 5,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 6,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 7,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 8,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 9,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 10,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 11,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 12,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
    {
        id: 13,
        previewImage: "/images/stub/product-stub.png",
        images: [
            "/images/stub/product-stub.png",
            "/images/stub/product-stub-2.png",
            "/images/stub/product-stub-3.png",
            "/images/stub/product-stub-4.png",
        ],
        isFavorite: true,
        name: "Зарядка для iphone 20W type-c быстрое устройство",
        price: {
            price: (500 * 4) / (4 + 2),
            discount: 20,
        },
        quantities: 221,
        tooltip: "Подсказка",
        productDescription:
            "Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. Быстрая зарядка для iPhone 20W с разъемом TYPE-C. Представляем Вашему вниманию адаптер быстрой зарядки который сможет зарядить ваш смартфон за считан. ",
        salesmanId: 4 + 1,
    },
];
