import { TNotificationItemProps } from "@/types";

export const NOTIFICATIONS: TNotificationItemProps[] = [
    {
        id: 1,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 2,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 3,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 4,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 5,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 6,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 7,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 8,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 9,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 10,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
    {
        id: 11,
        date: "Сегодня, 12:00",
        subtitle: "По выкупу 12345678 обновлен статус: ожидание текста отзыва",
        title: "Новый статус выкупа",
    },
];
